export const CARDS_TEXT = {
  PAY_TO_HIRE: {
    TITLE: '100% за выход сотрудника',
    TEXT: 'Если хотите, чтобы на заявку откликались «звёздные» рекрутеры с опытом, выбирайте этот вариант оплаты. Чтобы ещё больше повысить шансы на отклик от такого исполнителя, предлагайте оплату выше среднемесячного оклада нанимаемого кандидата',
  },
  FIFTY_FIFTY: {
    TITLE: '50% — после выхода, 50% — после гарантийного периода',
    TEXT: 'Гарантийный период — испытательный срок, который определяете вы. Обычно это 1 месяц после выхода сотрудника',
  },
  PAY_AFTER_MONTH: {
    TITLE: '100% после гарантийного периода',
    TEXT: 'За такие заявки берутся реже всего — для рекрутера это риск не получить оплату, если компани и сотрудник прекратят сотрудничество',
  },
};

export const POPUPS_TEXTS = {
  CANСEL_VACATION: {
    TITLE: 'Отменить создание вакансии',
    TEXT: 'Внесённые в форму данные будут потеряны и не будут учтены',
    SUCCESS_BUTTON_TEXT: 'Отменить',
    CANCEL_BUTTON_TEXT: 'Продолжить',
  },
  CANCEL_RECRUTER: {
    TITLE: 'Отменить заполнение условий сотрудничества',
    TEXT: 'Внесённые в форму данные будут потеряны и не будут учтены',
    SUCCESS_BUTTON_TEXT: 'Отменить',
    CANCEL_BUTTON_TEXT: 'Продолжить',
  },
  SAVE_DRAFT: {
    TITLE: 'Внесённые данные будут сохранены в «Черновиках»',
    TEXT: 'Внесённые данные по заявке будут сохранены и доступны в черновиках',
    SUCCESS_BUTTON_TEXT: 'Сохранить',
    CANCEL_BUTTON_TEXT: 'Отменить',
  },
};
