export const POPUPS_CONFIG = {
  CANСEL_VACATION: {
    TITLE: 'Отменить создание вакансии',
    TEXT: 'Внесённые в форму данные будут потеряны и не будут учтены',
    SUCCESS: 'Отменить',
    CANCEL: 'Продолжить',
  },
  CANCEL_RECRUTER: {
    TITLE: 'Отменить заполнение условий сотрудничества',
    TEXT: 'Внесённые в форму данные будут потеряны и не будут учтены',
    SUCCESS: 'Отменить',
    CANCEL: 'Продолжить',
  },
  SAVE_DRAFT: {
    TITLE: 'Внесённые данные будут сохранены в «Черновиках»',
    TEXT: 'Внесённые данные по заявке будут сохранены и доступны в черновиках',
    SUCCESS: 'Сохранить',
    CANCEL: 'Отменить',
  },
};

export const TABS_CONFIG = [
  { title: 'Описание вакансии', id: 1 },
  { title: 'Обязанности сотрудника', id: 2 },
  { title: 'Требования к соискателю', id: 3 },
  { title: 'Условия работы', id: 4 },
  { title: 'Дополнительные данные', id: 5 },
];
