export const CARDS_TEXT = {
  PAY_TO_HIRE: {
    TITLE: '100% за выход сотрудника',
    TEXT: 'Если хотите, чтобы на заявку откликались «звёздные» рекрутеры с опытом, выбирайте этот вариант оплаты. Чтобы ещё больше повысить шансы на отклик от такого исполнителя, предлагайте оплату выше среднемесячного оклада нанимаемого кандидата',
  },
  FIFTY_FIFTY: {
    TITLE: '50% — после выхода, 50% — после гарантийного периода',
    TEXT: 'Гарантийный период — испытательный срок, который определяете вы. Обычно это 1 месяц после выхода сотрудника',
  },
  PAY_AFTER_MONTH: {
    TITLE: '100% после гарантийного периода',
    TEXT: 'За такие заявки берутся реже всего — для рекрутера это риск не получить оплату, если компани и сотрудник прекратят сотрудничество',
  },
};

export const POPUPS_CONFIG = {
  CANСEL_VACATION: {
    TITLE: 'Отменить создание вакансии',
    TEXT: 'Внесённые в форму данные будут потеряны и не будут учтены',
    SUCCESS: 'Отменить',
    CANCEL: 'Продолжить',
  },
  CANCEL_RECRUTER: {
    TITLE: 'Отменить заполнение условий сотрудничества',
    TEXT: 'Внесённые в форму данные будут потеряны и не будут учтены',
    SUCCESS: 'Отменить',
    CANCEL: 'Продолжить',
  },
  SAVE_DRAFT: {
    TITLE: 'Внесённые данные будут сохранены в «Черновиках»',
    TEXT: 'Внесённые данные по заявке будут сохранены и доступны в черновиках',
    SUCCESS: 'Сохранить',
    CANCEL: 'Отменить',
  },
};

export const TABS_CONFIG = [
  { title: 'Описание вакансии', id: 1 },
  { title: 'Обязанности сотрудника', id: 2 },
  { title: 'Требования к соискателю', id: 3 },
  { title: 'Условия работы', id: 4 },
  { title: 'Дополнительные данные', id: 5 },
];

export const RESULT_TITLE = {
  vacancyName: 'Название вакансии',
  industry: 'Отрасль',
  responsibilities: 'Обязанности',
  skills: 'Навыки',
  experience: 'Опыт работы',
  education: 'Образование',
  type: 'Тип',
  salary: 'Зарплата',
  format: 'Формат',
  medical: 'ДМС',
  bonuses: 'Бонусы',
  location: 'Локация',
  banned: 'Стоп-лист',
  test: 'Тестовое задание',
};
